package net.pragyah.samskritam.ashtadhayayi.prathamah_adhyayh.prathamah_paadah

import net.pragyah.samskritam.upyogita.uchchaaran.अक्षर
import net.pragyah.samskritam.upyogita.uchchaaran.अक्षर._
import net.pragyah.samskritam.सूचि

/**
 * Created by vipul on 9/15/14.
 */
object sutras {

//  संज्ञा, परिभाषा, "", अतिदेशः, अधिकारः, संज्ञा; अधिकारः, "अतिदेशः; अधिकारः ")

  case class संज्ञा_सूत्र(val  सूत्र:String, val संज्ञा:String,val अक्षराणी:सूचि[अक्षर])
  case class परिभाषा(val  सूत्र:String)
  case class अतिदेशः(val  सूत्र:String)
  case class अधिकारः(val  सूत्र:String)
  case class अन्य(val  सूत्र:String)





  //
  //
  /**
   * १.१.१ वृद्धिरादैच- बृद्धिः अात् ऐच -
   * अर्थात आ  एवं एच् (ऐ औ)  वृद्धी हैं
   * सञ्ज्ञा सूत्र
   */
  val सूत्र_१_१_१ = संज्ञा_सूत्र("वृद्धिरादैच", "वृद्धि:", विश्लेषण("अाईऐ"))  //TODO इसे ठीक करें ० इश्रे प्रत्याहार स्वीकारना चाहिये


  /**
   *  १.१.२ अदेङ्गुण:   - अत्  एङ् गुणः
   *   अर्थात अ एवं एङ् (ए ओ) गुणः हैं
   *  संज्ञा सूत्र
   *
   */
  val सूत्र_१_१_२ = संज्ञा_सूत्र("अदेङ्गुणः", "गुणः", विश्लेषण("अाईऐ"))  //TODO इसे ठीक करें ० इश्रे प्रत्याहार स्वीकारना चाहिये


  /**
   *  १.१.३  इको गुणवृद्धी -> इकः गुण वृद्धी
   *   परिभाषा सूत्र
   *   जहाँ भी गुण या वृद्धी अाएगी स्थानी (वह अक्षर जिसके स्थान पर दूसरा अक्षर  - जिसे अादेशः कहते हैं -   अा रहा है) इक् होंगे
   *   स्थानी -> अादेश:
   *
   *
   *
   */


  /**
   *   १.१.४ न धातूलोप अर्धधातुके
   *   गुण एवँ वृद्धी का प्रयोग नहीं होगा जब "धातुलोप हो अौर अर्धधातु ..... "
   *
   *
   */

  /**
   *   १.१.५ क्ङिति च  (न गुण वृद्धी - पिछले सूत्र से)
   *       क्ङिति  = गित् कित् ङित्               प्रत्ययः
   *       गित् -> का अर्थ है ग+इत - अर्थात गकार का लोप/इत  हो जाता है
   *       कित् -> का अर्थ है क+इत - अर्थात ककार का लोप/इत  हो जाता है
   *       ङित् -> का अर्थ है ङ+इत - अर्थात ङकार का लोप/इत  हो जाता है
   *
   *      उदाहरण ग्स्नु -> स्नु
   *      ग् का लोप हो जाता है
   *      क्त -> त  क का लोप हो जाता है
   *      अब जहाँ जहाँ भी ग क ङ का लोप होता है वहाँ वहाँ गुण या वृद्धी नहीं होती
   *
   *      उ०
   *      जि + ग्स्नु => जिष्णु    (जेष्णु नहीं - इसलिये वृद्धी नहीं)
   *      जि + क्त => जित    (जित, चित, स्तुत अन्य उदाहरण)
   *      चि + ङित
   *
   *
   */


  /**
   *   १.१.६ दीधीवेवीाटम ्(न गुण वृद्धी)
   *   दीधी वेवी इटाम्
   *
   *
   *
   *
   *
   */













}
