package net.pragyah.samskritam.upyogita.uchchaaran

/**
 * Created by vipul on 3/30/14.
 */



object सत्य extends Enumeration{
  type  सत्य = Value
  val ना = Value(1)     // न के स्थान पर ना - क्योंकि न अपने में एक अक्षर है
  val अाम् = Value(2)
}

//implicit  def devnagriToBool


object समय extends Enumeration{
  type समय = Value
  val ह्रस्व= Value(1)
  val दीर्घ = Value(2)
}

object स्पर्ष_स्थान extends Enumeration{
  type स्पर्ष_स्थान = Value

  val अस्पर्ष = Value(0)
  val कण्ठ्य = Value(1)
  val तालव्य  = Value(2)
  val मूर्धन्य = Value(3)
  val दन्त्य = Value(4)
  val अोष्ठ्य = Value(5)
}

/**
 *
 */
object स्पर्ष_मात्रा extends Enumeration{
  type स्पर्ष_मात्रा = Value
  val पूर्ण = Value(10)
  val अन्तस्थ = Value(9)
  val पादोन = Value(7)  // 3/4th
  val अर्ध = Value(5)
  val शून्य = Value(0)



}


object प्राण extends Enumeration{
  type प्राण = Value

  val अल्पप्राण = Value(1)
  val महाप्राण = Value(2)
  val मा = Value(3)
}

// स्वरों में
object  जिह्वा_संकुचित extends Enumeration{
  type जिह्वा_संकुचित = Value
  val न_संकुचित = Value(1)   // अ   अा
  val अल्प_संकुचित = Value(2)  //उ,ऊ,
  val दीर्घ_संकुचित = Value(3)     //अो अौ
}



import सत्य._
import स्पर्ष_स्थान._
import प्राण._
import समय._
import स्पर्ष_मात्रा._
import जिह्वा_संकुचित._

case class अक्षर(
    स्थान : स्पर्ष_स्थान,
    प्राण : प्राण,
    समय : समय,
    स्पर्ष_मात्रा : स्पर्ष_मात्रा,
    जिह्वा_संकुचित:जिह्वा_संकुचित,// जिह्वा संकुचित अस्ति/नास्ति
    घोष : सत्य,
    अनुनासिक:सत्य,
    ऊष्म:सत्य
)


object अक्षर{


  /**
   * स्वर
   */

//  अपूर्ण
// val अ = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val अा = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val इ = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val ई = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val उ = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val ऊ = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val ए = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val ऐ = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val अो = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val औ = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val अं = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)
//  val अह् = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)


  /**
   * व्यन्जन
   */


  //असपर्ष
  val ह = new अक्षर(अस्पर्ष,महाप्राण, ह्रस्व,शून्य, न_संकुचित,  अाम्,  ना, अाम्)


  // कण्ठ्य
  val क = new अक्षर(कण्ठ्य,अल्पप्राण, ह्रस्व,पूर्ण,  न_संकुचित,  ना,  ना,  ना)
  val ख = new अक्षर(कण्ठ्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित,  ना,  ना,  ना)
  val ग = new अक्षर(कण्ठ्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val घ = new अक्षर(कण्ठ्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val ङ = new अक्षर(कण्ठ्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  अाम्,  अाम्, ना)


  // तालव्य
  val च = new अक्षर(तालव्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित, ना,  ना,  ना)
  val छ = new अक्षर(तालव्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित,ना,  ना,  ना)
  val ज = new अक्षर(तालव्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val झ = new अक्षर(तालव्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val ञ = new अक्षर(तालव्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  अाम्,  अाम्, ना)

  val य = new अक्षर(तालव्य,अल्पप्राण, ह्रस्व,अन्तस्थ, न_संकुचित,  अाम्,  ना, ना)

  val श = new अक्षर(तालव्य,महाप्राण, ह्रस्व,पादोन, न_संकुचित,  ना,  ना, अाम्)

  // मूर्धन्य
  val ट = new अक्षर(मूर्धन्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित, ना,  ना,  ना)
  val ठ = new अक्षर(मूर्धन्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित, ना,  ना,  ना)
  val ड = new अक्षर(मूर्धन्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val ढ = new अक्षर(मूर्धन्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val ण = new अक्षर(मूर्धन्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  अाम्,  अाम्, ना)

  val र = new अक्षर(मूर्धन्य,अल्पप्राण, ह्रस्व,अन्तस्थ, न_संकुचित,  अाम्,  ना, ना)

  val ष = new अक्षर(मूर्धन्य,महाप्राण, ह्रस्व,पादोन, न_संकुचित,  ना,  ना, अाम्)

  // दन्त्य
  val त = new अक्षर(दन्त्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  ना,  ना,  ना)
  val थ = new अक्षर(दन्त्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित,  ना,  ना,  ना)
  val द = new अक्षर(दन्त्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val ध = new अक्षर(दन्त्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val न = new अक्षर(दन्त्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  अाम्,  अाम्, ना)

  val ल = new अक्षर(दन्त्य,अल्पप्राण, ह्रस्व,अन्तस्थ, न_संकुचित,  अाम्,  ना, ना)

  val स = new अक्षर(दन्त्य,महाप्राण, ह्रस्व,पादोन, न_संकुचित,  ना,  ना, अाम्)

  // अोष्ठ्य
  val प = new अक्षर(अोष्ठ्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,ना,  ना,  ना)
  val फ = new अक्षर(अोष्ठ्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित, ना,  ना,  ना)
  val ब = new अक्षर(अोष्ठ्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val भ = new अक्षर(अोष्ठ्य,महाप्राण , ह्रस्व,पूर्ण, न_संकुचित,  अाम्, ना,  ना)
  val म = new अक्षर(अोष्ठ्य,अल्पप्राण, ह्रस्व,पूर्ण, न_संकुचित, अाम्,  अाम्, ना)

  val व = new अक्षर(अोष्ठ्य,अल्पप्राण, ह्रस्व,अन्तस्थ, न_संकुचित,  अाम्,  ना, ना)





}

