package net.pragyah.samskritam.upyogita.uchchaaran

/**
 * Created by vipul on 3/30/14.
 */



object सत्य extends Enumeration{
  type  सत्य = Value
  val ना = Value(1)     // न के स्थान पर ना - क्योंकि न अपने में एक अक्षर है
  val अाम् = Value(2)
}

//implicit  def devnagriToBool


object समय extends Enumeration{
  type समय = Value
  val न्यून = Value(0)
  val ह्रस्व= Value(1)
  val दीर्घ = Value(2)
}

object स्पर्ष_स्थान extends Enumeration{
  type स्पर्ष_स्थान = Value

  val अस्पर्ष = Value(0)
  val कण्ठ्य = Value(1)
  val तालव्य  = Value(2)
  val मूर्धन्य = Value(3)
  val दन्त्य = Value(4)
  val अोष्ठ्य = Value(5)
}

/**
 *
 */
object स्पर्ष_मात्रा extends Enumeration{
  type स्पर्ष_मात्रा = Value
  val पूर्ण = Value(10)
  val अन्तस्थ = Value(9)
  val पादोन = Value(7)  // 3/4th
  val अर्ध = Value(5)
  val शून्य = Value(0)



}


//case class स्पर्ष(स्थान:स्पर्ष_स्थान.स्पर्ष_स्थान , मात्रा : स्पर्ष_मात्रा.स्पर्ष_मात्रा )

object प्राण extends Enumeration{
  type प्राण = Value

  val मा = Value(0)
  val अल्पप्राण = Value(1)
  val महाप्राण = Value(2)
}

// स्वरों में
object  जिह्वा_संकुचित extends Enumeration{
  type जिह्वा_संकुचित = Value
  val न_संकुचित = Value(1)   // अ   अा
  val अल्प_संकुचित = Value(2)  //उ,ऊ,
  val दीर्घ_संकुचित = Value(3)     //अो अौ
}





object types{
  type स्पर्ष = (स्पर्ष_स्थान.स्पर्ष_स्थान ,  स्पर्ष_मात्रा.स्पर्ष_मात्रा )
}

object implicites {
  import types.स्पर्ष
  implicit def स्पर्ष_संयोजक  (स: स्पर्ष )= List(स)

}

import सत्य._
import प्राण._
import समय._
import जिह्वा_संकुचित._
import स्पर्ष_मात्रा._
import स्पर्ष_स्थान._
import implicites._
import types._


trait ध्वनि
{


  //  def ++ (अन्य: ध्वनि) :ध्वनि
}



case class अक्षर(
    स्पर्ष : List[स्पर्ष],
    प्राण : प्राण,
    समय : समय,
    जिह्वा_संकुचित:जिह्वा_संकुचित,// जिह्वा संकुचित अस्ति/नास्ति
    घोष : सत्य,
    अनुनासिक:सत्य,
    ऊष्म:सत्य
)   extends ध्वनि{


  def +(अन्य:अक्षर)=संयुक्ताक्षर(अाम,this,अन्य)  //इसे ढँग से करें
  def ++(अन्य:अक्षर)=संयुक्ताक्षर(ना,this,अन्य)


}

case class संयुक्ताक्षर(समकालीन: सत्य,घटक:अक्षर*)extends ध्वनि{

}


object अक्षर{

  import types.स्पर्ष
  /**
   * स्वर
   */

  val अ = new अक्षर((अस्पर्ष,शून्य),अल्पप्राण, ह्रस्व, न_संकुचित,  अाम्,  ना, अाम्)
  val अा = new अक्षर((अस्पर्ष,शून्य),अल्पप्राण, दीर्घ, न_संकुचित,  अाम्,  ना, अाम्)
  val इ = new अक्षर((तालव्य,पादोन),अल्पप्राण, ह्रस्व, न_संकुचित,  अाम्,  ना, अाम्)
  val ई = new अक्षर((तालव्य,पादोन),अल्पप्राण, दीर्घ, न_संकुचित,  अाम्,  ना, अाम्)
  val उ = new अक्षर((अोष्ठ्य,पादोन),अल्पप्राण, ह्रस्व, अल्प_संकुचित,  अाम्,  ना, अाम्)
  val ऊ = new अक्षर((अोष्ठ्य,पादोन),अल्पप्राण, दीर्घ, अल्प_संकुचित,  अाम्,  ना, अाम्)
  val ए = new अक्षर((तालव्य,अर्ध),अल्पप्राण, ह्रस्व, न_संकुचित,  अाम्,  ना, अाम्)
  val ऐ = new संयुक्ताक्षर(ना, अ,ई)
  val अो = new अक्षर((अोष्ठ्य,अर्ध),अल्पप्राण, ह्रस्व, दीर्घ_संकुचित,  अाम्,  ना, अाम्)
  val औ = new संयुक्ताक्षर(ना, अ,ऊ)
  val अं = new अक्षर((कण्ठ्य,शून्य),अल्पप्राण, ह्रस्व, न_संकुचित,  अाम्,  ना, अाम्)
  val अह्= new संयुक्ताक्षर(ना, अ,ह्)


  /**
   * व्यन्जन
   */


  //असपर्ष
  val ह् = new अक्षर((अस्पर्ष,शून्य),महाप्राण, न्यून, न_संकुचित,  अाम्,  ना, अाम्)


  // कण्ठ्य
  val क् = new अक्षर((कण्ठ्य,पूर्ण),अल्पप्राण, न्यून,  न_संकुचित,  ना,  ना,  ना)
  val ख् = new अक्षर((कण्ठ्य,पूर्ण),महाप्राण , न्यून, न_संकुचित,  ना,  ना,  ना)
  val ग् = new अक्षर((कण्ठ्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित,  अाम्, ना,  ना)
  val घ् = new अक्षर((कण्ठ्य,पूर्ण),महाप्राण , न्यून, न_संकुचित,  अाम्, ना,  ना)
  val ङ् = new अक्षर((कण्ठ्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित,  अाम्,  अाम्, ना)


  // तालव्य
  val च् = new अक्षर((तालव्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित, ना,  ना,  ना)
  val छ् = new अक्षर((तालव्य,पूर्ण),महाप्राण , न्यून,न_संकुचित,ना,  ना,  ना)
  val ज् = new अक्षर((तालव्य,पूर्ण),अल्पप्राण, न्यून,न_संकुचित,  अाम्, ना,  ना)
  val झ् = new अक्षर((तालव्य,पूर्ण),महाप्राण , न्यून,न_संकुचित,  अाम्, ना,  ना)
  val ञ् = new अक्षर((तालव्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित,  अाम्,  अाम्, ना)

  val य् = new अक्षर((तालव्य,अन्तस्थ),अल्पप्राण, न्यून,न_संकुचित,  अाम्,  ना, ना)

  val श् = new अक्षर((तालव्य,पादोन),महाप्राण, न्यून, न_संकुचित,  ना,  ना, अाम्)

  // मूर्धन्य
  val ट् = new अक्षर((मूर्धन्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित, ना,  ना,  ना)
  val ठ् = new अक्षर((मूर्धन्य,पूर्ण),महाप्राण , न्यून,न_संकुचित, ना,  ना,  ना)
  val ड् = new अक्षर((मूर्धन्य,पूर्ण),अल्पप्राण, न्यून,न_संकुचित,  अाम्, ना,  ना)
  val ढ् = new अक्षर((मूर्धन्य,पूर्ण),महाप्राण , न्यून,न_संकुचित,  अाम्, ना,  ना)
  val ण् = new अक्षर((मूर्धन्य,पूर्ण),अल्पप्राण, न्यून,न_संकुचित,  अाम्,  अाम्, ना)

  val र् = new अक्षर((मूर्धन्य,अन्तस्थ),अल्पप्राण, न्यून, न_संकुचित,  अाम्,  ना, ना)

  val ष् = new अक्षर((मूर्धन्य,पादोन),महाप्राण, न्यून, न_संकुचित,  ना,  ना, अाम्)

  // दन्त्य
  val त् = new अक्षर((दन्त्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित,  ना,  ना,  ना)
  val थ् = new अक्षर((दन्त्य,पूर्ण),महाप्राण , न्यून, न_संकुचित,  ना,  ना,  ना)
  val द् = new अक्षर((दन्त्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित,  अाम्, ना,  ना)
  val ध् = new अक्षर((दन्त्य,पूर्ण),महाप्राण , न्यून, न_संकुचित,  अाम्, ना,  ना)
  val न् = new अक्षर((दन्त्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित,  अाम्,  अाम्, ना)

  val ल् = new अक्षर((दन्त्य,अन्तस्थ),अल्पप्राण, न्यून,न_संकुचित,  अाम्,  ना, ना)

  val स् = new अक्षर((दन्त्य,पादोन),महाप्राण, न्यून, न_संकुचित,  ना,  ना, अाम्)

  // अोष्ठ्य
  val प् = new अक्षर((अोष्ठ्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित,ना,  ना,  ना)
  val फ् = new अक्षर((अोष्ठ्य,पूर्ण),महाप्राण , न्यून, न_संकुचित, ना,  ना,  ना)
  val ब् = new अक्षर((अोष्ठ्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित,  अाम्, ना,  ना)
  val भ् = new अक्षर((अोष्ठ्य,पूर्ण),महाप्राण , न्यून, न_संकुचित,  अाम्, ना,  ना)
  val म् = new अक्षर((अोष्ठ्य,पूर्ण),अल्पप्राण, न्यून, न_संकुचित, अाम्,  अाम्, ना)

  val व् = new अक्षर((अोष्ठ्य,अन्तस्थ),अल्पप्राण, न्यून, न_संकुचित,  अाम्,  ना, ना)





}

